convergenceStudy/1/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../data"
expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
		uWater $uWater;
		uAir $uAir;
		hRef $hRef;
                hMin $hMin;
		k $k;
		z0 $z0;
        }
        variables
        (
        );

        condition
        #{
		pos().z()>0
        #};

        expression
        #{
            vector
            (
                ($constants.k*($constants.uAir-$constants.uWater)/(log($constants.hRef/$constants.z0+1))*log((pos().z()+$constants.z0)/$constants.z0)/$constants.k+$constants.uWater),
		0.0,
                0.0
            )
        #};
	}

    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
                uWater $uWater;
                uAir $uAir;
                hRef $hRef;
                hMin $hMin;
                k $k;
                z0 $z0;
                uWaterMin $uWaterMin;
                alpha $alpha;
        }
        variables
        (
        );

        condition
        #{
                pos().z()<0
        #};

        expression
        #{
            vector
            (
		$constants.uWaterMin+($constants.uWater-$constants.uWaterMin)*exp($constants.alpha*pos().z()),
                0.0,
                0.0
            )
        #};
    }
);
